{
  "quiz_id": "PW02-QZ-0001",
  "module_code": "PW02",
  "questions": [
    {
      "id": "PW02-T3-001",
      "stem": "A shopping site you use was breached yesterday, and you realise the same password unlocks your email and cloud photos. In 1–3 sentences, explain the danger of this practice and what you would do next.",
      "rubric": [
        {"point": "Identifies risk of password reuse across services", "value": 1, "weight": 0.40},
        {"point": "Says to change to unique passwords for each account", "value": 1, "weight": 0.35},
        {"point": "Mentions using a password manager to handle the change", "value": 1, "weight": 0.25}
      ],
      "difficulty": 3
    },
    {
      "id": "PW02-T3-002",
      "stem": "Your laptop login is your dog’s name plus your birth year because it’s easy to remember. Briefly describe why this could be guessed and how you would create a stronger replacement.",
      "rubric": [
        {"point": "Notes personal info passwords are easy to guess or discover", "value": 1, "weight": 0.40},
        {"point": "Proposes a long (12+), random or pass-phrase style password", "value": 1, "weight": 0.35},
        {"point": "Suggests avoiding dictionary words or obvious patterns", "value": 1, "weight": 0.25}
      ],
      "difficulty": 3
    },
    {
      "id": "PW02-T4-003",
      "stem": "A friend asks for your streaming-service password for the weekend. In a couple of sentences, outline the security risk and a safer way, if any, to share access.",
      "rubric": [
        {"point": "Explains malware on friend’s device could steal the password", "value": 1, "weight": 0.40},
        {"point": "Suggests creating a separate profile/temp code or refusing share", "value": 1, "weight": 0.35},
        {"point": "Mentions enabling or relying on 2FA/device sign-out later", "value": 1, "weight": 0.25}
      ],
      "difficulty": 4
    },
    {
      "id": "PW02-T4-004",
      "stem": "Your workplace now forces a password change every 60 days. In 1–3 sentences, describe two practical methods you will use to keep strong, unique passwords without forgetting them.",
      "rubric": [
        {"point": "Plans to use a reputable password manager", "value": 1, "weight": 0.40},
        {"point": "Mentions generating long complex passwords or pass-phrases", "value": 1, "weight": 0.35},
        {"point": "Adds using 2FA or backup codes for extra safety", "value": 1, "weight": 0.25}
      ],
      "difficulty": 4
    },
    {
      "id": "PW02-T5-005",
      "stem": "You hear your favourite forum leaked its user database last month. Outline, in 2–3 sentences, a layered response that protects your other accounts and future logins.",
      "rubric": [
        {"point": "Change the compromised password and any other reused ones", "value": 1, "weight": 0.35},
        {"point": "Enable 2FA on important accounts to limit damage", "value": 1, "weight": 0.30},
        {"point": "Store new unique passwords in a manager and monitor for further breaches", "value": 1, "weight": 0.35}
      ],
      "difficulty": 5
    }
  ]
}
